---
kind: method
id: M:Autodesk.Revit.UI.ColorSelectionDialog.Dispose
source: html/ffa5bdb9-b90b-c470-3ddc-0c4c8463c8a3.htm
---
# Autodesk.Revit.UI.ColorSelectionDialog.Dispose Method

Releases all resources used by the ColorSelectionDialog

## Syntax (C#)
```csharp
public void Dispose()
```